app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    #get songs by artist if params[artist_id] is given
    if params[:artist_id]
      #check if artist is found
      @artist = Artist.find(params[:artist_id])

      if Artist.find(params[:artist_id])
        @songs = Artist.find(params[:artist_id]).songs
      else
        flash[:alert] = "Artist not found."
        redirect_to 'artists'
        binding.pry
      end

    #get all songs
    else
      @songs = Songs.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if Song.find_by(id: params[:id])